src/Catalogs/ИС_МП_Токены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ИС_МП_Токены</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ИС_WB_Профили</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Маркетплейс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_МП_Маркетплейсы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Токен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Добавлен</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СвойстваТокенаВБ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контент</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цены</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Маркетплейс</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статистика</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продвижение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вопросы</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чат</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Возвраты</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документы</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тарифы</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТолькоЧтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТестовыйКонтур</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ИС_МП_Токены/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Ивонин К.А. 20.01.25 УА #89159
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Объект.Ссылка.Пустая() И Не Параметры.ЗначенияЗаполнения.Свойство("Владелец") Тогда
		ОбщегоНазначения.СообщитьПользователю("Токен можно создать только из справочника Профили");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 20.01.25 УА #89159

//+ ИнфоСофт Ивонин К.А. 27.01.25 УА #89159
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеФормой();
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 27.01.25 УА #89159

//+ ИнфоСофт Ивонин К.А. 27.01.25 УА #89159
&НаКлиенте
Процедура ТокенОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ОчиститьСообщения();
	
	Если Объект.Маркетплейс <> ПредопределенноеЗначение("Перечисление.ИС_МП_Маркетплейсы.ВБ") Тогда
		Возврат;
	КонецЕсли;
	
	Текст = СокрЛП(Текст);
	
	Объект.СвойстваТокенаВБ.Очистить();
	
	СтруктураРасшифровки = РасшифроватьНаСервере(Текст);
	
	Если СтруктураРасшифровки = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Возможно некорректный токен", , , "Токен");
		Возврат;
	КонецЕсли;
	
	НоваяСтрока = Объект.СвойстваТокенаВБ.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураРасшифровки);
	
	Объект.Токен = Текст;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 27.01.25 УА #89159

//+ ИнфоСофт Ивонин К.А. 27.01.25 УА #89159
&НаКлиенте
Процедура МаркетплейсПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 27.01.25 УА #89159

//+ ИнфоСофт Ивонин К.А. 17.02.25 УА #89159
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОбновитьПовторноИспользуемыеЗначения();
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 17.02.25 УА #89159

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Ивонин К.А. 27.01.25 УА #89159
&НаКлиенте
Процедура УправлениеФормой()
	Элементы.СвойстваТокенаВБ.Видимость = 
		Объект.Маркетплейс = ПредопределенноеЗначение("Перечисление.ИС_МП_Маркетплейсы.ВБ");
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 27.01.25 УА #89159

//+ ИнфоСофт Ивонин К.А. 27.01.25 УА #89159
&НаСервереБезКонтекста   
Функция РасшифроватьНаСервере(Токен)
	Возврат ИС_ВБ_Сервер.ДанныеТокена(Токен);
КонецФункции //- ИнфоСофт Ивонин К.А. 27.01.25 УА #89159

#КонецОбласти
